tap "amazon/amazon", "ssh://git.amazon.com/pkg/HomebrewAmazon"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

cask_args appdir: "~/Applications", require_sha: true

brew "curl"
brew "git"
brew "grep"
brew "libffi"
brew "libyaml"
brew "ninja-dev-sync"
brew "python@3.9"
brew "rbenv"
brew "ruby"
brew "rustup-init"
brew "scala"
brew "scala@2.11"
brew "yadm"
brew "zsh"
brew "amazon/amazon/ninja-dev-sync"
cask "amazon-acronyms"
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"

# TODO: reinstall these with brew
# cask "iterm2"
# cask "slack"
# cask "intellij-idea"
# cask "firefox"
# cask "google-chrome"
# cask "visual-studio-code"
# cask "font-meslo-nerd-font"
