tap "homebrew/bundle"
tap "homebrew/core"

def exists?(name)
    system "which #{name} &> /dev/null"
end

brew "bat" unless exists? "bat"
brew "curl" unless exists? "curl"
brew "gh" unless exists? "gh"
brew "git-delta" unless exists? "delta"
brew "git" unless exists? "git"
brew "grep"
brew "pyenv" unless exists? "pyenv"
brew "rbenv" unless exists? "rbenv"
brew "rustup-init" unless exists? "rustup"
brew "zsh" unless exists? "zsh"

if OS.mac?
    tap "homebrew/cask"
    cask_args appdir: "~/Applications", require_sha: true

    def app_exists?(name)
        File.exists?("/Applications/#{name}.app")
    end

    # Casks -----------------------------------------------------------
    cask "firefox" unless app_exists? "Firefox"
    cask "google-chrome" unless app_exists? "Google Chrome"
    cask "iterm2" unless app_exists? "iTerm"
    cask "rectangle" unless app_exists? "Rectangle"
    cask "visual-studio-code" unless app_exists? "Visual Studio Code"

    # Fonts -----------------------------------------------------------
    tap "homebrew/cask-fonts"

    cask "font-caskaydia-cove-nerd-font"
    cask "font-hack-nerd-font"
    cask "font-meslo-lg-nerd-font"

    # Amazon ---------------------------------------------------------
    tap "amazon/amazon", "ssh://git.amazon.com/pkg/HomebrewAmazon"

    brew "ninja-dev-sync"
    brew "scala" unless exists? "scala"
    brew "scala@2.11"
    cask "amazon-acronyms"
    cask "intellij-idea" unless app_exists? "IntelliJ IDEA"
    cask "postman" unless app_exists? "Postman"
end
